//指定条目数

tips = new Array(51);

//条目内容

tips[0] = 'OMNIA7长按视窗按钮进入语音控制。';

tips[1] = 'HTC的机型在开机时，同时按住音量的向上和向下两个键可进行快速硬复位（硬启）。';

tips[2] = '大约有50个地方长按后能弹出隐藏选项。';

tips[3] = '在Picture HUB里面的ALL屏下空白处长按会弹出Change background，可以设置Picture HUB的主背景。';

tips[4] = '可使用WIFI无线网络同步Zune软件，并发送多媒体文件到手机上。';

tips[5] = '在手机的Zune播放器里面对当前正在播放的音乐的封面轻点一下，会有循环，收藏，无序选择。';

tips[6] = 'WP7支持SIM卡联系人导入：在setting（设置）里面右滑一屏，Applications里面能找到一个people设置，里面就有导入SIM的按钮。';

tips[7] = 'WP7支持SIM卡联系人导入：在setting（设置）里面右滑一屏，Applications里面能找到一个people设置，里面就有导入SIM的按钮。';

tips[8] = 'wp7是支持拼音排序的，把system local设置成chinese（prc）。注意修改语言选项是要点上面一个链接来重启手机才会生效。';

tips[9] = '你可以在Windows LIVE官方网站编辑或导入你的联系人:http://people.live.com';

tips[10] = '网络锁：对于国内用户而言，被限制了网络锁的机型往往是国外某些活动销售或者通过签约获得的。国内买了这种机型如果没有解锁就不能打电话发短信。';

tips[11] = '手机上第一次绑定的那个帐号是无法再更改的，如果新机到手有陌生帐号，就只有先还原自己的手机到出厂。';

tips[12] = '推荐利用ZUNE客户端的向导重新申请一个新的LIVE帐号（应该说是ZUNE通行证），这样能保证申请到的是可用的帐号。';

tips[13] = '在程序菜单中长按要删除的程序，会出现uninstall，点击即卸载。';

tips[14] = '进入Setting--application关闭auto upload和SkyDrive将大幅度节省你的手机流量，建议关闭。';

tips[15] = '手机同步上Zune客户端以后就能共享电脑的网络了。';

tips[16] = 'SETTINGS→CELLULAR→DATA CONNECTION（ON/OFF），这里是手机流量的大门，关闭它是节省流量的最有效方式。';

tips[17] = '飞行模式下你还可以再手动开启WIFI和蓝牙。';

tips[18] = 'IE有的时候会多次刷新仍打不开网站，可以尝试在设置里面清理IE缓存。';

tips[19] = 'Zune4.7软件市场上同一个帐号只能安装一次，如果安装的软件卸载了想再安装，就只有在手机的市场上再次进行。';

tips[20] = '大部分收费软件都是有试用的，所以不要因为看到价格高而放弃下载。';

tips[21] = 'XBOXLIVE游戏安装完以后不会出现在APP列表，他们都集合在XBOXLIVE HUB里面。';

tips[22] = '手机上进入Marketplace后可以按放大镜（搜索键）搜索你要的软件。';

tips[23] = '如果手机没有绑定windows live 那么下载应用的时候会弹出对话框要求先输入live用户名密码绑定。';

tips[24] = 'WP7没进入中国的时候，必须设置PC上控制面板的地区为 美国，Zune客户端上Marketplace才会有显示。';

tips[25] = '目前美国地区Live帐号支持的服务最多。';

tips[26] = '如果你的手机上绑定的Windows Live帐号和ZUNE上面登录的帐号不同，那么最终要下载的时候仍然会提示登录一次手机上的那个Live帐号。';

tips[27] = '注意ZUNE4.7的安装过程是没有进度条的，安装成功了也没有提示，因此不要以为到了最后一步软件就安装上了，要耐心等待。';

tips[28] = '你可以直接拖动媒体文件到Zune客户端的媒体库，然后再从媒体库拖动文件到手机。';

tips[29] = 'Zune图片同步的时候默认是会压缩的，你可以到设置项的“图片与视频”里面选择第二项不压缩。';

tips[30] = '注意要打开路由器的SSID广播 ，热点才能被WP7搜索到。';

tips[31] = '注意要打开路由器的SSID广播 ，热点才能被WP7搜索到。';

tips[32] = 'Windows Phone 7的网络请求优先级是Zune同步>WiFi>GPRS/3G。';

tips[33] = '三星手机可以让电脑共享其无线网络，但手机默认没有开启。';

tips[34] = '手机默认设置允许使用照相机按钮将电话唤醒。';

tips[35] = '目前Bing地图还是英文的，而且还是很老的，不适应中国地理，所以拿着WP7走路还是要看前面滴。';

tips[36] = '手机端恢复出厂设置，步骤是到setting（设置）>>about（关于）>>Reset your phone（恢复出厂）。';

tips[37] = '到https://devices.live.com/设置好Find this phone有助于降低手机被盗丢失的风险。';

tips[38] = 'Chrome to WP7软件可以快速的将PC端的网页链接推送到手机。';

tips[39] = '很多平台都支持Exchange同步，例如WM的ActiveSync。利用这项服务可以在多平台之间同步联系人';

tips[40] = '部署XAP需要SDK，可SDK不支持XP系统，不过你可以安装VS2010来代替SDK。';

tips[41] = 'IE浏览器支持标签，但只支持六个。';

tips[42] = '在Office文档里面选中一个单词，然后按搜索键，可以立即打开Bing搜索出这个单词的相关网页。';

tips[43] = '在某些设置里面，千万不要忽视向左滑动。';

tips[44] = '键盘里面长按.com键，还能选择.org、.edu和.net。';

tips[45] = '注意软件有新版本提示下载时，试用的软件是不能直接更新的，必须卸载后重新安装。';

tips[46] = '想知道你短信是否发送成功？您可以在系统设置里面打开短信发送确认。';

tips[47] = '来电时按下音量键就能立刻静音';

tips[48] = '在您的电子邮件列表中点击屏幕的左侧，可以弹出复选框，批量删除邮件。';

tips[49] = 'WP7默认只同步近3天的邮件，你可以在邮件设置中设定sync settings改变同步周期。';

tips[50] = '三星的AMOLED屏幕由于是自发光，所以在有大量黑色显示的情况下是最省电的，白色则相对耗电很多。';

index = Math.floor(Math.random() * tips.length);

document.write(tips[index]);